{
    "format": "layers-model",
    "generatedBy": "keras v2.12.0",
    "convertedBy": "TensorFlow.js Converter v4.4.0",
    "modelTopology": {
      "keras_version": "2.12.0",
      "backend": "tensorflow",
      "model_config": {
        "class_name": "Functional",
        "config": {
          "name": "multi_disease_model",
          "layers": [
            {
              "class_name": "InputLayer",
              "config": {
                "batch_input_shape": [null, 20],
                "dtype": "float32",
                "sparse": false,
                "ragged": false,
                "name": "input_features"
              },
              "name": "input_features",
              "inbound_nodes": []
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "shared_hidden_1",
                "trainable": true,
                "dtype": "float32",
                "units": 64,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "shared_hidden_1",
              "inbound_nodes": [
                [
                  ["input_features", 0, 0, {}]
                ]
              ]
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_1",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.3,
                "noise_shape": null,
                "seed": null
              },
              "name": "dropout_1",
              "inbound_nodes": [
                [
                  ["shared_hidden_1", 0, 0, {}]
                ]
              ]
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "shared_hidden_2",
                "trainable": true,
                "dtype": "float32",
                "units": 32,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "shared_hidden_2",
              "inbound_nodes": [
                [
                  ["dropout_1", 0, 0, {}]
                ]
              ]
            },
            {
              "class_name": "Dropout",
              "config": {
                "name": "dropout_2",
                "trainable": true,
                "dtype": "float32",
                "rate": 0.2,
                "noise_shape": null,
                "seed": null
              },
              "name": "dropout_2",
              "inbound_nodes": [
                [
                  ["shared_hidden_2", 0, 0, {}]
                ]
              ]
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "parkinsons_hidden",
                "trainable": true,
                "dtype": "float32",
                "units": 16,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "parkinsons_hidden",
              "inbound_nodes": [
                [
                  ["dropout_2", 0, 0, {}]
                ]
              ]
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "ckd_hidden",
                "trainable": true,
                "dtype": "float32",
                "units": 16,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "ckd_hidden",
              "inbound_nodes": [
                [
                  ["dropout_2", 0, 0, {}]
                ]
              ]
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "alzheimers_hidden",
                "trainable": true,
                "dtype": "float32",
                "units": 16,
                "activation": "relu",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "alzheimers_hidden",
              "inbound_nodes": [
                [
                  ["dropout_2", 0, 0, {}]
                ]
              ]
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "parkinsons_output",
                "trainable": true,
                "dtype": "float32",
                "units": 1,
                "activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "parkinsons_output",
              "inbound_nodes": [
                [
                  ["parkinsons_hidden", 0, 0, {}]
                ]
              ]
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "ckd_output",
                "trainable": true,
                "dtype": "float32",
                "units": 1,
                "activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "ckd_output",
              "inbound_nodes": [
                [
                  ["ckd_hidden", 0, 0, {}]
                ]
              ]
            },
            {
              "class_name": "Dense",
              "config": {
                "name": "alzheimers_output",
                "trainable": true,
                "dtype": "float32",
                "units": 1,
                "activation": "sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
              },
              "name": "alzheimers_output",
              "inbound_nodes": [
                [
                  ["alzheimers_hidden", 0, 0, {}]
                ]
              ]
            }
          ],
          "input_layers": [
            ["input_features", 0, 0]
          ],
          "output_layers": [
            ["parkinsons_output", 0, 0],
            ["ckd_output", 0, 0],
            ["alzheimers_output", 0, 0]
          ]
        }
      },
      "training_config": {
        "loss": {
          "parkinsons_output": "binary_crossentropy",
          "ckd_output": "binary_crossentropy",
          "alzheimers_output": "binary_crossentropy"
        },
        "metrics": [
          [
            {
              "class_name": "AUC",
              "config": {
                "name": "auc",
                "dtype": "float32",
                "num_thresholds": 200,
                "curve": "ROC",
                "summation_method": "interpolation",
                "thresholds": [
                  0.0,
                  0.005,
                  0.01,
                  0.015,
                  0.02,
                  0.025,
                  0.03,
                  0.035,
                  0.04,
                  0.045,
                  0.05,
                  0.055,
                  0.06,
                  0.065,
                  0.07,
                  0.075,
                  0.08,
                  0.085,
                  0.09,
                  0.095,
                  0.1,
                  0.105,
                  0.11,
                  0.115,
                  0.12,
                  0.125,
                  0.13,
                  0.135,
                  0.14,
                  0.145,
                  0.15,
                  0.155,
                  0.16,
                  0.165,
                  0.17,
                  0.175,
                  0.18,
                  0.185,
                  0.19,
                  0.195,
                  0.2,
                  0.205,
                  0.21,
                  0.215,
                  0.22,
                  0.225,
                  0.23,
                  0.235,
                  0.24,
                  0.245,
                  0.25,
                  0.255,
                  0.26,
                  0.265,
                  0.27,
                  0.275,
                  0.28,
                  0.285,
                  0.29,
                  0.295,
                  0.3,
                  0.305,
                  0.31,
                  0.315,
                  0.32,
                  0.325,
                  0.33,
                  0.335,
                  0.34,
                  0.345,
                  0.35,
                  0.355,
                  0.36,
                  0.365,
                  0.37,
                  0.375,
                  0.38,
                  0.385,
                  0.39,
                  0.395,
                  0.4,
                  0.405,
                  0.41,
                  0.415,
                  0.42,
                  0.425,
                  0.43,
                  0.435,
                  0.44,
                  0.445,
                  0.45,
                  0.455,
                  0.46,
                  0.465,
                  0.47,
                  0.475,
                  0.48,
                  0.485,
                  0.49,
                  0.495,
                  0.5,
                  0.505,
                  0.51,
                  0.515,
                  0.52,
                  0.525,
                  0.53,
                  0.535,
                  0.54,
                  0.545,
                  0.55,
                  0.555,
                  0.56,
                  0.565,
                  0.57,
                  0.575,
                  0.58,
                  0.585,
                  0.59,
                  0.595,
                  0.6,
                  0.605,
                  0.61,
                  0.615,
                  0.62,
                  0.625,
                  0.63,
                  0.635,
                  0.64,
                  0.645,
                  0.65,
                  0.655,
                  0.66,
                  0.665,
                  0.67,
                  0.675,
                  0.68,
                  0.685,
                  0.69,
                  0.695,
                  0.7,
                  0.705,
                  0.71,
                  0.715,
                  0.72,
                  0.725,
                  0.73,
                  0.735,
                  0.74,
                  0.745,
                  0.75,
                  0.755,
                  0.76,
                  0.765,
                  0.77,
                  0.775,
                  0.78,
                  0.785,
                  0.79,
                  0.795,
                  0.8,
                  0.805,
                  0.81,
                  0.815,
                  0.82,
                  0.825,
                  0.83,
                  0.835,
                  0.84,
                  0.845,
                  0.85,
                  0.855,
                  0.86,
                  0.865,
                  0.87,
                  0.875,
                  0.88,
                  0.885,
                  0.89,
                  0.895,
                  0.9,
                  0.905,
                  0.91,
                  0.915,
                  0.92,
                  0.925,
                  0.93,
                  0.935,
                  0.94,
                  0.945,
                  0.95,
                  0.955,
                  0.96,
                  0.965,
                  0.97,
                  0.975,
                  0.98,
                  0.985,
                  0.99,
                  0.995
                ],
                "multi_label": false,
                "label_weights": null
              }
            }
          ]
        ],
        "weighted_metrics": null,
        "loss_weights": {
          "parkinsons_output": 1.0,
          "ckd_output": 1.0,
          "alzheimers_output": 1.0
        },
        "optimizer_config": {
          "class_name": "Adam",
          "config": {
            "name": "Adam",
            "learning_rate": 0.001,
            "decay": 0.0,
            "beta_1": 0.9,
            "beta_2": 0.999,
            "epsilon": 1e-7,
            "amsgrad": false
          }
        }
      }
    },
    "weightsManifest": [
      {
        "paths": ["weights.bin"],
        "weights": [
          {
            "name": "shared_hidden_1/kernel",
            "shape": [20, 64],
            "dtype": "float32"
          },
          {
            "name": "shared_hidden_1/bias",
            "shape": [64],
            "dtype": "float32"
          },
          {
            "name": "shared_hidden_2/kernel",
            "shape": [64, 32],
            "dtype": "float32"
          },
          {
            "name": "shared_hidden_2/bias",
            "shape": [32],
            "dtype": "float32"
          },
          {
            "name": "parkinsons_hidden/kernel",
            "shape": [32, 16],
            "dtype": "float32"
          },
          {
            "name": "parkinsons_hidden/bias",
            "shape": [16],
            "dtype": "float32"
          },
          {
            "name": "ckd_hidden/kernel",
            "shape": [32, 16],
            "dtype": "float32"
          },
          {
            "name": "ckd_hidden/bias",
            "shape": [16],
            "dtype": "float32"
          },
          {
            "name": "alzheimers_hidden/kernel",
            "shape": [32, 16],
            "dtype": "float32"
          },
          {
            "name": "alzheimers_hidden/bias",
            "shape": [16],
            "dtype": "float32"
          },
          {
            "name": "parkinsons_output/kernel",
            "shape": [16, 1],
            "dtype": "float32"
          },
          {
            "name": "parkinsons_output/bias",
            "shape": [1],
            "dtype": "float32"
          },
          {
            "name": "ckd_output/kernel",
            "shape": [16, 1],
            "dtype": "float32"
          },
          {
            "name": "ckd_output/bias",
            "shape": [1],
            "dtype": "float32"
          },
          {
            "name": "alzheimers_output/kernel",
            "shape": [16, 1],
            "dtype": "float32"
          },
          {
            "name": "alzheimers_output/bias",
            "shape": [1],
            "dtype": "float32"
          }
        ]
      }
    ]
  }